Revit 2027 API
NumberingParameter Constructor
 Create a new parameter with association based on a parameter id and an association type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public NumberingParameter(
	ElementId parameterId,
	NumberingParameterType numberingParameterType
)
Public Sub New (
	parameterId As ElementId,
	numberingParameterType As NumberingParameterType
)
public:
NumberingParameter(
	ElementId^ parameterId,
	NumberingParameterType numberingParameterType
)
new :
        parameterId : ElementId *
        numberingParameterType : NumberingParameterType -> NumberingParameter
Parameters
parameterId ElementId
 The parameter id for the target parameter.
numberingParameterType NumberingParameterType
 The target for the associated parameter.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  The enum is invalid for NumberingParameterType. -or- A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
NumberingParameter Class
Autodesk.Revit.DB Namespace